turbulenceMMAOpt/app_iso_brinkmanKEps_20260323/constant/optProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      optProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

raa0                1e-5;
voluse              0.4;
mma_init            0.3;
mma_dec             0.7;
mma_inc             1.2;
movlim              0.4;
filterR             2.5;
PowerDiss0          9.3e-8;
PowerDissMax        10;
PowerDissRelax      25;
powerConstraintRelaxationRate 0.2;
GeoDim              2;
fluid_area          yes;
solid_area          no;
test_area           no;
Pnorm               300;
objFunction         1;
qAlpha0             0.005;
qAlphaMin           1e-3;
qKappa0             0.005;
qKappaMin           1e-3;
qHeat0              0.005;
qHeatMin            1e-3;
qSingle0            0.005;
qSingleMin          0.005;
qContinuationStartIter 1000;
qContinuationInterval 10;
qContinuationFactor 0.9;
beta0               0.2;
betaMax             100;
betaIncrement       0.2;
alphaRampEarlySlope 0.142857142857;
alphaRampLateFactor 1.05;
dAlphaPorosityEps   1e-3;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //  
